app/controllers/admins/items_controller.rb

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)