app/controllers/customers/addresses_controller.rb

  def create
    @address = current_customer.addresses.new(address_params)
    @address.save
---
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 4], ["name", "abcd"], ["postal_code", "1810123"], ["address", "東京都吉祥寺中央区６−６−６"], ["created_at", "2021-10-23 04:22:10.868131"], ["updated_at", "2021-10-23 04:22:10.868131"]]

  def edit
    @address = current_customer.addresses.find(params[:id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ? AND "addresses"."id" = ? LIMIT ?  [["customer_id", 4], ["id", 8], ["LIMIT", 1]]

  def update
    @address = current_customer.addresses.find(params[:id])
    @address.update(address_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ? AND "addresses"."id" = ? LIMIT ?  [["customer_id", 4], ["id", 9], ["LIMIT", 1]]
UPDATE "addresses" SET "address" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["address", "aaaaaaaa"], ["updated_at", "2021-10-23 05:19:10.421092"], ["id", 9]]

  def destroy
    @address = Address.find(params[:id])
    @address.destroy
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 7]]