app/controllers/customers/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
---
  def index
    @cart_items = current_customer.cart_items
    @sum = 0
    @cart_items.each do |cart_item|
      @subtotal = (Item.find(cart_item.item_id).taxed_price* cart_item.amount).to_i

INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 32], ["customer_id", 4], ["amount", 1], ["created_at", "2021-10-24 00:16:03.589717"], ["updated_at", "2021-10-24 00:16:03.589717"]]
---
  def create
    @cart_item = CartItem.new(cart_item_params)
    @cart_item.customer_id = current_customer.id
    @cart_item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 3], ["updated_at", "2021-10-24 00:21:12.882160"], ["id", 5]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item.update(cart_item_params)
    @customer = Customer.find(current_customer.id)

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 2]]
---
  def destroy
    cart_item = CartItem.find(params[:id])
    if cart_item.destroy

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 5]]
---
  def destroy_all
    customer = Customer.find(current_customer.id)
    customer.cart_items.destroy_all