app/controllers/customers/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    # @customer = current_customer.customers
    @customer = Customer.find(params[:id])