app/controllers/customers/items_controller.rb

  def index
    @items = Item.all.order(id: "DESC")
---
SELECT "items".* FROM "items" ORDER BY "items"."id" DESC

  def show
    @item = Item.find(params[:id])
    if current_customer.present?
      items = current_customer.cart_items
      # CartItemモデルに対して親がUserとProductでそれぞれの親にアソシエーションはないのでこの記述
      # 中間モデルでもう少しシンプルにかけると思われる
      if items.find_by(item_id: @item.id).present?
        @cart_item = items.find_by(item_id: @item.id)
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 1], ["item_id", 32], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]