app/controllers/customers/orders_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 4]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
---
  def confirm
    @cart_items = current_customer.cart_items
    @sum = 0
      @cart_items.each do |cart_item|
        @subtotal = (Item.find(cart_item.item_id).taxed_price* cart_item.amount).to_i