app/controllers/customers/orders_controller.rb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
INSERT INTO "orders" ("payment_method", "postal_code", "address", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["payment_method", 1], ["postal_code", ""], ["address", ""], ["name", ""], ["created_at", "2021-10-26 04:32:13.365742"], ["updated_at", "2021-10-26 04:32:13.365742"]]
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 4], ["name", ""], ["postal_code", ""], ["address", ""], ["created_at", "2021-10-26 04:17:52.638340"], ["updated_at", "2021-10-26 04:17:52.638340"]]
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 4], ["name", ""], ["postal_code", ""], ["address", ""], ["created_at", "2021-10-26 05:05:04.985266"], ["updated_at", "2021-10-26 05:05:04.985266"]]
INSERT INTO "orders" ("postal_code", "address", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["postal_code", ""], ["address", ""], ["name", ""], ["created_at", "2021-10-26 04:15:38.707232"], ["updated_at", "2021-10-26 04:15:38.707232"]]
---
  def confirm
    @order = Order.new(order_params)
    case params[:delivary_type]
    when "0" then
      @order.postal_code = current_customer.postal_code
      @order.address = current_customer.address
      @order.name = current_customer.first_name + current_customer.last_name
    when "1" then
      @address = Address.find(params[:order][:select_address])
      @order.postal_code = @address.postal_code
      @order.address = @address.address
      @order.name = @address.name
    else
      current_user.addresses.create!(
        postal_code: @order.postal_code,
        address: @order.address,
        name: @order.name
      )
    end
    @order.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "orders" ("payment_method", "postal_code", "address", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["payment_method", 1], ["postal_code", ""], ["address", ""], ["name", ""], ["created_at", "2021-10-26 03:37:26.148159"], ["updated_at", "2021-10-26 03:37:26.148159"]]
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 4], ["name", ""], ["postal_code", ""], ["address", ""], ["created_at", "2021-10-26 03:22:17.484167"], ["updated_at", "2021-10-26 03:22:17.484167"]]
---
  def create
    @order = Order.new(order_params)
    case params[:delivary_type]
    when "0" then
      @order.postal_code = current_customer.postal_code
      @order.address = current_customer.address
      @order.name = current_customer.first_name + current_customer.last_name
    when "1" then
      @address = Address.find(params[:order][:select_address])
      @order.postal_code = @address.postal_code
      @order.address = @address.address
      @order.name = @address.name
    else
      current_customer.addresses.create!(
        postal_code: @order.postal_code,
        address: @order.address,
        name: @order.name
      )
    end
    @order.save