app/views/customers/orders/new.html.erb

      <%= f.label "登録済み住所から選択" %><br/>
      <%= f.select :select_address, options_from_collection_for_select(current_customer.addresses, :id, :full_address) %>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?  [["customer_id", 4]]