app/views/admins/items/new.html.erb

        <div>
          <%= f.collection_select :genre_id, Genre.all, :id, :name, include_blank: '--選択してください--' %>
---
SELECT "genres".* FROM "genres"