app/views/customers/cart_items/index.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
---
      <div class="text-start">
        <% if current_customer.cart_items.present? %>